// const data = [{
//         "name": "金明校区",
//         "storeys": [{
//                 "name": "金明二楼",
//                 "rooms": [{
//                         "room_id": "001",
//                         "name": "二楼南副楼走廊"
//                     },
//                     {
//                         "room_id": "002",
//                         "name": "二楼北副楼走廊"
//                     },
//                     {
//                         "room_id": "003",
//                         "name": "二楼大厅走廊"
//                     },
//                     {
//                         "room_id": "004",
//                         "name": "201经管教外文阅览室"
//                     },
//                     {
//                         "room_id": "005",
//                         "name": "202自然科学阅览室"
//                     },
//                     {
//                         "room_id": "006",
//                         "name": "208过刊阅览室"
//                     },
//                     {
//                         "room_id": "007",
//                         "name": "209报纸阅览室"
//                     }
//                 ]
//             },
//             {
//                 "name": "金明三楼",
//                 "rooms": [{
//                         "room_id": "008",
//                         "name": "三楼南副楼走廊"
//                     },
//                     {
//                         "room_id": "009",
//                         "name": "三楼北副楼走廊"
//                     }, {
//                         "room_id": "010",
//                         "name": "三楼大厅走廊"
//                     }, {
//                         "room_id": "011",
//                         "name": "305视频点播室"
//                     }, {
//                         "room_id": "012",
//                         "name": "308现刊阅览室"
//                     }
//                 ]
//             },
//             {
//                 "name": "金明四楼",
//                 "rooms": [{
//                         "room_id": "013",
//                         "name": "四楼南副楼走廊"
//                     },
//                     {
//                         "room_id": "014",
//                         "name": "四楼北附楼走廊"
//                     },
//                     {
//                         "room_id": "015",
//                         "name": "四楼大厅走廊"
//                     },
//                     {
//                         "room_id": "016",
//                         "name": "401医学生物数理化书库"
//                     }
//                 ]
//             },
//             {
//                 "name": "金明五楼",
//                 "rooms": [{
//                         "room_id": "017",
//                         "name": "五楼大厅走廊"
//                     },
//                     {
//                         "room_id": "018",
//                         "name": "501经管教外文书库"
//                     },
//                     {
//                         "room_id": "019",
//                         "name": "502科学技术书库"
//                     }
//                 ]
//             },
//             {
//                 "name": "金明六楼",
//                 "rooms": [{
//                         "room_id": "020",
//                         "name": "六层东走廊"
//                     },
//                     {
//                         "room_id": "021",
//                         "name": "601社会科学书库",
//                     },
//                     {
//                         "room_id": "022",
//                         "name": "602文学语言艺术书库"
//                     }
//                 ]
//             },
//             {
//                 "name": "金明七楼",
//                 "rooms": [{
//                         "room_id": "023",
//                         "name": "701七层南自习室"
//                     },
//                     {
//                         "room_id": "024",
//                         "name": "702七层北自习室"
//                     }
//                 ]
//             }
//         ]
//     },
//     {
//         "name": "明伦校区",
//         "storeys": [{
//                 "name": "明伦一层",
//                 "rooms": [{
//                     "room_id": "025",
//                     "name": "西馆基藏报刊阅览室"
//                 }]
//             },
//             {
//                 "name": "明伦三层",
//                 "rooms": [{
//                         "room_id": "026",
//                         "name": "东馆社会科学阅览室"
//                     },
//                     {
//                         "room_id": "027",
//                         "name": "西馆第二借书处"
//                     },
//                     {
//                         "room_id": "028",
//                         "name": "西馆现刊第一阅览室"
//                     }, {
//                         "room_id": "029",
//                         "name": "西馆现刊第二阅览室"
//                     }
//                 ]
//             },
//             {
//                 "name": "明伦四层",
//                 "rooms": [{
//                         "room_id": "030",
//                         "name": "东馆文学艺术阅览室"
//                     },
//                     {
//                         "room_id": "031",
//                         "name": "西馆自习室"
//                     },
//                     {
//                         "room_id": "032",
//                         "name": "西馆报纸阅览室"
//                     }
//                 ]
//             },
//             {
//                 "name": "明伦五层",
//                 "rooms": [{
//                     "room_id": "033",
//                     "name": "东馆素质教育阅览室"
//                 }]
//             }
//         ]
//     }
// ]


const data = [{
    "name": "金明校区",
    "id": "01",
    "buildings": [{
      "name": "金明图书馆",
      "id": "01",
      "storeys": [{
        "name": "金明图书馆一层",
        "id": "01",
        "rooms": [{
          "id": "010101001",
          "name": "一层东大厅"
        }]
      }, {
        "name": "金明图书馆二层",
        "id": "02",
        "rooms": [{
          "id": "010102001",
          "name": "东馆社会科学阅览室"
        }, {
          "id": "010102002",
          "name": "西馆第二借书处"
        }]
      }]
    }, {
      "name": "曾宪梓楼实验室",
      "id": "02",
      "storeys": [{
        "name": "曾宪梓楼实验室六层",
        "id": "06",
        "rooms": [{
          "id": "020206001",
          "name": "图像实验室"
        }]
      }, {
        "name": "曾宪梓楼实验室五层",
        "id": "05",
        "rooms": [{
          "id": "020205001",
          "name": "大数据实验室"
        }, {
          "id": "020205002",
          "name": "物联网实验室"
        }]
      }]
    }]
  }, {
    "name": "明伦校区",
    "id": "02",
    "buildings": [{
      "name": "明伦图书馆",
      "id": "01",
      "storeys": [{
        "name": "明伦图书馆一层",
        "id": "01",
        "rooms": [{
          "id": "020101001",
          "name": "西馆基藏报刊阅览室"
        }]
      }, {
        "name": "明伦图书馆二层",
        "id": "02",
        "rooms": [{
          "id": "020102001",
          "name": "东馆社会科学阅览室"
        }, {
          "id": "020102002",
          "name": "西馆第二借书处"
        }]
      }]
    }]
  }
]

module.exports = {
  data
}